Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/rp2350/Includes/Registers/RP2350_otp.h
/*
SPDX-License-Identifier: MIT
SPDX-FileCopyrightText: 2025-2026 Edo. Franzi
*/

/*
; RP2350_otp.
; ===========

;------------------------------------------------------------------------
; Author:   Generated using the .svd description    The 2025-01-01
; Modifs:
;
; Project:  uKOS-X
; Goal:     RP2350_otp equates.
;
;   (c) 2025-2026, Edo. Franzi
;   --------------------------
;                                              __ ______  _____
;   Edo. Franzi                         __  __/ //_/ __ \/ ___/
;   5-Route de Cheseaux                / / / / ,< / / / /\__ \
;   CH 1400 Cheseaux-Noréaz           / /_/ / /| / /_/ /___/ /
;                                     \__,_/_/ |_\____//____/
;   edo.franzi@ukos.ch
;
;   Description: Lightweight, real-time multitasking operating
;   system for embedded microcontroller and DSP-based systems.
;
;   Permission is hereby granted, free of charge, to any person
;   obtaining a copy of this software and associated documentation
;   files (the "Software"), to deal in the Software without restriction,
;   including without limitation the rights to use, copy, modify,
;   merge, publish, distribute, sublicense, and/or sell copies of the
;   Software, and to permit persons to whom the Software is furnished
;   to do so, subject to the following conditions:
;
;   The above copyright notice and this permission notice shall be
;   included in all copies or substantial portions of the Software.
;
;   THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND,
;   EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF
;   MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND
;   NONINFRINGEMENT. IN NO EVENT SHALL THE AUTHORS OR COPYRIGHT HOLDERS
;   BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY, WHETHER IN AN
;   ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM, OUT OF OR IN
;   CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE
;   SOFTWARE.
;
;------------------------------------------------------------------------
*/

#pragma once

#include    <stdint.h>

// OTP address definitions
// -----------------------

typedef struct {
    volatile    uint32_t    SW_LOCK0;
    volatile    uint32_t    SW_LOCK1;
    volatile    uint32_t    SW_LOCK2;
    volatile    uint32_t    SW_LOCK3;
    volatile    uint32_t    SW_LOCK4;
    volatile    uint32_t    SW_LOCK5;
    volatile    uint32_t    SW_LOCK6;
    volatile    uint32_t    SW_LOCK7;
    volatile    uint32_t    SW_LOCK8;
    volatile    uint32_t    SW_LOCK9;
    volatile    uint32_t    SW_LOCK10;
    volatile    uint32_t    SW_LOCK11;
    volatile    uint32_t    SW_LOCK12;
    volatile    uint32_t    SW_LOCK13;
    volatile    uint32_t    SW_LOCK14;
    volatile    uint32_t    SW_LOCK15;
    volatile    uint32_t    SW_LOCK16;
    volatile    uint32_t    SW_LOCK17;
    volatile    uint32_t    SW_LOCK18;
    volatile    uint32_t    SW_LOCK19;
    volatile    uint32_t    SW_LOCK20;
    volatile    uint32_t    SW_LOCK21;
    volatile    uint32_t    SW_LOCK22;
    volatile    uint32_t    SW_LOCK23;
    volatile    uint32_t    SW_LOCK24;
    volatile    uint32_t    SW_LOCK25;
    volatile    uint32_t    SW_LOCK26;
    volatile    uint32_t    SW_LOCK27;
    volatile    uint32_t    SW_LOCK28;
    volatile    uint32_t    SW_LOCK29;
    volatile    uint32_t    SW_LOCK30;
    volatile    uint32_t    SW_LOCK31;
    volatile    uint32_t    SW_LOCK32;
    volatile    uint32_t    SW_LOCK33;
    volatile    uint32_t    SW_LOCK34;
    volatile    uint32_t    SW_LOCK35;
    volatile    uint32_t    SW_LOCK36;
    volatile    uint32_t    SW_LOCK37;
    volatile    uint32_t    SW_LOCK38;
    volatile    uint32_t    SW_LOCK39;
    volatile    uint32_t    SW_LOCK40;
    volatile    uint32_t    SW_LOCK41;
    volatile    uint32_t    SW_LOCK42;
    volatile    uint32_t    SW_LOCK43;
    volatile    uint32_t    SW_LOCK44;
    volatile    uint32_t    SW_LOCK45;
    volatile    uint32_t    SW_LOCK46;
    volatile    uint32_t    SW_LOCK47;
    volatile    uint32_t    SW_LOCK48;
    volatile    uint32_t    SW_LOCK49;
    volatile    uint32_t    SW_LOCK50;
    volatile    uint32_t    SW_LOCK51;
    volatile    uint32_t    SW_LOCK52;
    volatile    uint32_t    SW_LOCK53;
    volatile    uint32_t    SW_LOCK54;
    volatile    uint32_t    SW_LOCK55;
    volatile    uint32_t    SW_LOCK56;
    volatile    uint32_t    SW_LOCK57;
    volatile    uint32_t    SW_LOCK58;
    volatile    uint32_t    SW_LOCK59;
    volatile    uint32_t    SW_LOCK60;
    volatile    uint32_t    SW_LOCK61;
    volatile    uint32_t    SW_LOCK62;
    volatile    uint32_t    SW_LOCK63;
    volatile    uint32_t    SBPI_INSTR;
    volatile    uint32_t    SBPI_WDATA_0;
    volatile    uint32_t    SBPI_WDATA_1;
    volatile    uint32_t    SBPI_WDATA_2;
    volatile    uint32_t    SBPI_WDATA_3;
    volatile    uint32_t    SBPI_RDATA_0;
    volatile    uint32_t    SBPI_RDATA_1;
    volatile    uint32_t    SBPI_RDATA_2;
    volatile    uint32_t    SBPI_RDATA_3;
    volatile    uint32_t    SBPI_STATUS;
    volatile    uint32_t    USR;
    volatile    uint32_t    DBG;
    volatile    uint32_t    RESERVED0;
    volatile    uint32_t    BIST;
    volatile    uint32_t    CRT_KEY_W0;
    volatile    uint32_t    CRT_KEY_W1;
    volatile    uint32_t    CRT_KEY_W2;
    volatile    uint32_t    CRT_KEY_W3;
    volatile    uint32_t    CRITICAL;
    volatile    uint32_t    KEY_VALID;
    volatile    uint32_t    DEBUGEN;
    volatile    uint32_t    DEBUGEN_LOCK;
    volatile    uint32_t    ARCHSEL;
    volatile    uint32_t    ARCHSEL_STATUS;
    volatile    uint32_t    BOOTDIS;
    volatile    uint32_t    INTR;
    volatile    uint32_t    INTE;
    volatile    uint32_t    INTF;
    volatile    uint32_t    INTS;
} OTP_TypeDef;

#ifdef __cplusplus
#define OTP_NS  reinterpret_cast<OTP_TypeDef *>(0x40120000u)
#define OTP_S   reinterpret_cast<OTP_TypeDef *>(0x40120000u)
#else
#define OTP_NS  ((OTP_TypeDef *)0x40120000u)
#define OTP_S   ((OTP_TypeDef *)0x40120000u)
#endif

// SW_LOCK0 Configuration

