Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/rp2350/Includes/Registers/RP2350_otp.h
#define OTP_SW_LOCK0_SEC                    (0x3u<<0)
#define OTP_SW_LOCK0_SEC_0                  (0x1u<<0)
#define OTP_SW_LOCK0_NSEC                   (0x3u<<2)
#define OTP_SW_LOCK0_NSEC_0                 (0x1u<<2)
#define OTP_SW_LOCK0_SEC_READ_WRITE         (0x0u<<0)
#define OTP_SW_LOCK0_SEC_READ_ONLY          (0x1u<<0)
#define OTP_SW_LOCK0_SEC_INACCESSIBLE       (0x3u<<0)
#define OTP_SW_LOCK0_NSEC_READ_WRITE        (0x0u<<2)
#define OTP_SW_LOCK0_NSEC_READ_ONLY         (0x1u<<2)
#define OTP_SW_LOCK0_NSEC_INACCESSIBLE      (0x3u<<2)

// SW_LOCK1 Configuration

#define OTP_SW_LOCK1_SEC                    (0x3u<<0)
#define OTP_SW_LOCK1_SEC_0                  (0x1u<<0)
#define OTP_SW_LOCK1_NSEC                   (0x3u<<2)
#define OTP_SW_LOCK1_NSEC_0                 (0x1u<<2)
#define OTP_SW_LOCK1_SEC_READ_WRITE         (0x0u<<0)
#define OTP_SW_LOCK1_SEC_READ_ONLY          (0x1u<<0)
#define OTP_SW_LOCK1_SEC_INACCESSIBLE       (0x3u<<0)
#define OTP_SW_LOCK1_NSEC_READ_WRITE        (0x0u<<2)
#define OTP_SW_LOCK1_NSEC_READ_ONLY         (0x1u<<2)
#define OTP_SW_LOCK1_NSEC_INACCESSIBLE      (0x3u<<2)

// SW_LOCK2 Configuration

#define OTP_SW_LOCK2_SEC                    (0x3u<<0)
#define OTP_SW_LOCK2_SEC_0                  (0x1u<<0)
#define OTP_SW_LOCK2_NSEC                   (0x3u<<2)
#define OTP_SW_LOCK2_NSEC_0                 (0x1u<<2)
#define OTP_SW_LOCK2_SEC_READ_WRITE         (0x0u<<0)
#define OTP_SW_LOCK2_SEC_READ_ONLY          (0x1u<<0)
#define OTP_SW_LOCK2_SEC_INACCESSIBLE       (0x3u<<0)
#define OTP_SW_LOCK2_NSEC_READ_WRITE        (0x0u<<2)
#define OTP_SW_LOCK2_NSEC_READ_ONLY         (0x1u<<2)
#define OTP_SW_LOCK2_NSEC_INACCESSIBLE      (0x3u<<2)

// SW_LOCK3 Configuration

#define OTP_SW_LOCK3_SEC                    (0x3u<<0)
#define OTP_SW_LOCK3_SEC_0                  (0x1u<<0)
#define OTP_SW_LOCK3_NSEC                   (0x3u<<2)
#define OTP_SW_LOCK3_NSEC_0                 (0x1u<<2)
#define OTP_SW_LOCK3_SEC_READ_WRITE         (0x0u<<0)
#define OTP_SW_LOCK3_SEC_READ_ONLY          (0x1u<<0)
#define OTP_SW_LOCK3_SEC_INACCESSIBLE       (0x3u<<0)
#define OTP_SW_LOCK3_NSEC_READ_WRITE        (0x0u<<2)
#define OTP_SW_LOCK3_NSEC_READ_ONLY         (0x1u<<2)
#define OTP_SW_LOCK3_NSEC_INACCESSIBLE      (0x3u<<2)

// SW_LOCK4 Configuration

#define OTP_SW_LOCK4_SEC                    (0x3u<<0)
#define OTP_SW_LOCK4_SEC_0                  (0x1u<<0)
#define OTP_SW_LOCK4_NSEC                   (0x3u<<2)
#define OTP_SW_LOCK4_NSEC_0                 (0x1u<<2)
#define OTP_SW_LOCK4_SEC_READ_WRITE         (0x0u<<0)
#define OTP_SW_LOCK4_SEC_READ_ONLY          (0x1u<<0)
#define OTP_SW_LOCK4_SEC_INACCESSIBLE       (0x3u<<0)
#define OTP_SW_LOCK4_NSEC_READ_WRITE        (0x0u<<2)
#define OTP_SW_LOCK4_NSEC_READ_ONLY         (0x1u<<2)
#define OTP_SW_LOCK4_NSEC_INACCESSIBLE      (0x3u<<2)

// SW_LOCK5 Configuration

#define OTP_SW_LOCK5_SEC                    (0x3u<<0)
#define OTP_SW_LOCK5_SEC_0                  (0x1u<<0)
#define OTP_SW_LOCK5_NSEC                   (0x3u<<2)
#define OTP_SW_LOCK5_NSEC_0                 (0x1u<<2)
#define OTP_SW_LOCK5_SEC_READ_WRITE         (0x0u<<0)
#define OTP_SW_LOCK5_SEC_READ_ONLY          (0x1u<<0)
#define OTP_SW_LOCK5_SEC_INACCESSIBLE       (0x3u<<0)
#define OTP_SW_LOCK5_NSEC_READ_WRITE        (0x0u<<2)
#define OTP_SW_LOCK5_NSEC_READ_ONLY         (0x1u<<2)
#define OTP_SW_LOCK5_NSEC_INACCESSIBLE      (0x3u<<2)

// SW_LOCK6 Configuration

#define OTP_SW_LOCK6_SEC                    (0x3u<<0)
#define OTP_SW_LOCK6_SEC_0                  (0x1u<<0)
#define OTP_SW_LOCK6_NSEC                   (0x3u<<2)
#define OTP_SW_LOCK6_NSEC_0                 (0x1u<<2)
#define OTP_SW_LOCK6_SEC_READ_WRITE         (0x0u<<0)
#define OTP_SW_LOCK6_SEC_READ_ONLY          (0x1u<<0)
#define OTP_SW_LOCK6_SEC_INACCESSIBLE       (0x3u<<0)
#define OTP_SW_LOCK6_NSEC_READ_WRITE        (0x0u<<2)
#define OTP_SW_LOCK6_NSEC_READ_ONLY         (0x1u<<2)
#define OTP_SW_LOCK6_NSEC_INACCESSIBLE      (0x3u<<2)

// SW_LOCK7 Configuration

#define OTP_SW_LOCK7_SEC                    (0x3u<<0)
#define OTP_SW_LOCK7_SEC_0                  (0x1u<<0)
#define OTP_SW_LOCK7_NSEC                   (0x3u<<2)
#define OTP_SW_LOCK7_NSEC_0                 (0x1u<<2)
#define OTP_SW_LOCK7_SEC_READ_WRITE         (0x0u<<0)
#define OTP_SW_LOCK7_SEC_READ_ONLY          (0x1u<<0)
#define OTP_SW_LOCK7_SEC_INACCESSIBLE       (0x3u<<0)
#define OTP_SW_LOCK7_NSEC_READ_WRITE        (0x0u<<2)
#define OTP_SW_LOCK7_NSEC_READ_ONLY         (0x1u<<2)
#define OTP_SW_LOCK7_NSEC_INACCESSIBLE      (0x3u<<2)

// SW_LOCK8 Configuration

#define OTP_SW_LOCK8_SEC                    (0x3u<<0)
#define OTP_SW_LOCK8_SEC_0                  (0x1u<<0)
#define OTP_SW_LOCK8_NSEC                   (0x3u<<2)
#define OTP_SW_LOCK8_NSEC_0                 (0x1u<<2)
#define OTP_SW_LOCK8_SEC_READ_WRITE         (0x0u<<0)
#define OTP_SW_LOCK8_SEC_READ_ONLY          (0x1u<<0)
#define OTP_SW_LOCK8_SEC_INACCESSIBLE       (0x3u<<0)
#define OTP_SW_LOCK8_NSEC_READ_WRITE        (0x0u<<2)
#define OTP_SW_LOCK8_NSEC_READ_ONLY         (0x1u<<2)
#define OTP_SW_LOCK8_NSEC_INACCESSIBLE      (0x3u<<2)

// SW_LOCK9 Configuration

#define OTP_SW_LOCK9_SEC                    (0x3u<<0)
#define OTP_SW_LOCK9_SEC_0                  (0x1u<<0)
#define OTP_SW_LOCK9_NSEC                   (0x3u<<2)
#define OTP_SW_LOCK9_NSEC_0                 (0x1u<<2)
#define OTP_SW_LOCK9_SEC_READ_WRITE         (0x0u<<0)
#define OTP_SW_LOCK9_SEC_READ_ONLY          (0x1u<<0)
#define OTP_SW_LOCK9_SEC_INACCESSIBLE       (0x3u<<0)
#define OTP_SW_LOCK9_NSEC_READ_WRITE        (0x0u<<2)
#define OTP_SW_LOCK9_NSEC_READ_ONLY         (0x1u<<2)
#define OTP_SW_LOCK9_NSEC_INACCESSIBLE      (0x3u<<2)

// SW_LOCK10 Configuration

#define OTP_SW_LOCK10_SEC                   (0x3u<<0)
#define OTP_SW_LOCK10_SEC_0                 (0x1u<<0)
#define OTP_SW_LOCK10_NSEC                  (0x3u<<2)
#define OTP_SW_LOCK10_NSEC_0                (0x1u<<2)
#define OTP_SW_LOCK10_SEC_READ_WRITE        (0x0u<<0)
#define OTP_SW_LOCK10_SEC_READ_ONLY         (0x1u<<0)
#define OTP_SW_LOCK10_SEC_INACCESSIBLE      (0x3u<<0)
#define OTP_SW_LOCK10_NSEC_READ_WRITE       (0x0u<<2)
#define OTP_SW_LOCK10_NSEC_READ_ONLY        (0x1u<<2)
#define OTP_SW_LOCK10_NSEC_INACCESSIBLE     (0x3u<<2)

