Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/rp2350/Includes/Registers/RP2350_otp.h
// SW_LOCK11 Configuration

#define OTP_SW_LOCK11_SEC                   (0x3u<<0)
#define OTP_SW_LOCK11_SEC_0                 (0x1u<<0)
#define OTP_SW_LOCK11_NSEC                  (0x3u<<2)
#define OTP_SW_LOCK11_NSEC_0                (0x1u<<2)
#define OTP_SW_LOCK11_SEC_READ_WRITE        (0x0u<<0)
#define OTP_SW_LOCK11_SEC_READ_ONLY         (0x1u<<0)
#define OTP_SW_LOCK11_SEC_INACCESSIBLE      (0x3u<<0)
#define OTP_SW_LOCK11_NSEC_READ_WRITE       (0x0u<<2)
#define OTP_SW_LOCK11_NSEC_READ_ONLY        (0x1u<<2)
#define OTP_SW_LOCK11_NSEC_INACCESSIBLE     (0x3u<<2)

// SW_LOCK12 Configuration

#define OTP_SW_LOCK12_SEC                   (0x3u<<0)
#define OTP_SW_LOCK12_SEC_0                 (0x1u<<0)
#define OTP_SW_LOCK12_NSEC                  (0x3u<<2)
#define OTP_SW_LOCK12_NSEC_0                (0x1u<<2)
#define OTP_SW_LOCK12_SEC_READ_WRITE        (0x0u<<0)
#define OTP_SW_LOCK12_SEC_READ_ONLY         (0x1u<<0)
#define OTP_SW_LOCK12_SEC_INACCESSIBLE      (0x3u<<0)
#define OTP_SW_LOCK12_NSEC_READ_WRITE       (0x0u<<2)
#define OTP_SW_LOCK12_NSEC_READ_ONLY        (0x1u<<2)
#define OTP_SW_LOCK12_NSEC_INACCESSIBLE     (0x3u<<2)

// SW_LOCK13 Configuration

#define OTP_SW_LOCK13_SEC                   (0x3u<<0)
#define OTP_SW_LOCK13_SEC_0                 (0x1u<<0)
#define OTP_SW_LOCK13_NSEC                  (0x3u<<2)
#define OTP_SW_LOCK13_NSEC_0                (0x1u<<2)
#define OTP_SW_LOCK13_SEC_READ_WRITE        (0x0u<<0)
#define OTP_SW_LOCK13_SEC_READ_ONLY         (0x1u<<0)
#define OTP_SW_LOCK13_SEC_INACCESSIBLE      (0x3u<<0)
#define OTP_SW_LOCK13_NSEC_READ_WRITE       (0x0u<<2)
#define OTP_SW_LOCK13_NSEC_READ_ONLY        (0x1u<<2)
#define OTP_SW_LOCK13_NSEC_INACCESSIBLE     (0x3u<<2)

// SW_LOCK14 Configuration

#define OTP_SW_LOCK14_SEC                   (0x3u<<0)
#define OTP_SW_LOCK14_SEC_0                 (0x1u<<0)
#define OTP_SW_LOCK14_NSEC                  (0x3u<<2)
#define OTP_SW_LOCK14_NSEC_0                (0x1u<<2)
#define OTP_SW_LOCK14_SEC_READ_WRITE        (0x0u<<0)
#define OTP_SW_LOCK14_SEC_READ_ONLY         (0x1u<<0)
#define OTP_SW_LOCK14_SEC_INACCESSIBLE      (0x3u<<0)
#define OTP_SW_LOCK14_NSEC_READ_WRITE       (0x0u<<2)
#define OTP_SW_LOCK14_NSEC_READ_ONLY        (0x1u<<2)
#define OTP_SW_LOCK14_NSEC_INACCESSIBLE     (0x3u<<2)

// SW_LOCK15 Configuration

#define OTP_SW_LOCK15_SEC                   (0x3u<<0)
#define OTP_SW_LOCK15_SEC_0                 (0x1u<<0)
#define OTP_SW_LOCK15_NSEC                  (0x3u<<2)
#define OTP_SW_LOCK15_NSEC_0                (0x1u<<2)
#define OTP_SW_LOCK15_SEC_READ_WRITE        (0x0u<<0)
#define OTP_SW_LOCK15_SEC_READ_ONLY         (0x1u<<0)
#define OTP_SW_LOCK15_SEC_INACCESSIBLE      (0x3u<<0)
#define OTP_SW_LOCK15_NSEC_READ_WRITE       (0x0u<<2)
#define OTP_SW_LOCK15_NSEC_READ_ONLY        (0x1u<<2)
#define OTP_SW_LOCK15_NSEC_INACCESSIBLE     (0x3u<<2)

// SW_LOCK16 Configuration

#define OTP_SW_LOCK16_SEC                   (0x3u<<0)
#define OTP_SW_LOCK16_SEC_0                 (0x1u<<0)
#define OTP_SW_LOCK16_NSEC                  (0x3u<<2)
#define OTP_SW_LOCK16_NSEC_0                (0x1u<<2)
#define OTP_SW_LOCK16_SEC_READ_WRITE        (0x0u<<0)
#define OTP_SW_LOCK16_SEC_READ_ONLY         (0x1u<<0)
#define OTP_SW_LOCK16_SEC_INACCESSIBLE      (0x3u<<0)
#define OTP_SW_LOCK16_NSEC_READ_WRITE       (0x0u<<2)
#define OTP_SW_LOCK16_NSEC_READ_ONLY        (0x1u<<2)
#define OTP_SW_LOCK16_NSEC_INACCESSIBLE     (0x3u<<2)

// SW_LOCK17 Configuration

#define OTP_SW_LOCK17_SEC                   (0x3u<<0)
#define OTP_SW_LOCK17_SEC_0                 (0x1u<<0)
#define OTP_SW_LOCK17_NSEC                  (0x3u<<2)
#define OTP_SW_LOCK17_NSEC_0                (0x1u<<2)
#define OTP_SW_LOCK17_SEC_READ_WRITE        (0x0u<<0)
#define OTP_SW_LOCK17_SEC_READ_ONLY         (0x1u<<0)
#define OTP_SW_LOCK17_SEC_INACCESSIBLE      (0x3u<<0)
#define OTP_SW_LOCK17_NSEC_READ_WRITE       (0x0u<<2)
#define OTP_SW_LOCK17_NSEC_READ_ONLY        (0x1u<<2)
#define OTP_SW_LOCK17_NSEC_INACCESSIBLE     (0x3u<<2)

// SW_LOCK18 Configuration

#define OTP_SW_LOCK18_SEC                   (0x3u<<0)
#define OTP_SW_LOCK18_SEC_0                 (0x1u<<0)
#define OTP_SW_LOCK18_NSEC                  (0x3u<<2)
#define OTP_SW_LOCK18_NSEC_0                (0x1u<<2)
#define OTP_SW_LOCK18_SEC_READ_WRITE        (0x0u<<0)
#define OTP_SW_LOCK18_SEC_READ_ONLY         (0x1u<<0)
#define OTP_SW_LOCK18_SEC_INACCESSIBLE      (0x3u<<0)
#define OTP_SW_LOCK18_NSEC_READ_WRITE       (0x0u<<2)
#define OTP_SW_LOCK18_NSEC_READ_ONLY        (0x1u<<2)
#define OTP_SW_LOCK18_NSEC_INACCESSIBLE     (0x3u<<2)

// SW_LOCK19 Configuration

#define OTP_SW_LOCK19_SEC                   (0x3u<<0)
#define OTP_SW_LOCK19_SEC_0                 (0x1u<<0)
#define OTP_SW_LOCK19_NSEC                  (0x3u<<2)
#define OTP_SW_LOCK19_NSEC_0                (0x1u<<2)
#define OTP_SW_LOCK19_SEC_READ_WRITE        (0x0u<<0)
#define OTP_SW_LOCK19_SEC_READ_ONLY         (0x1u<<0)
#define OTP_SW_LOCK19_SEC_INACCESSIBLE      (0x3u<<0)
#define OTP_SW_LOCK19_NSEC_READ_WRITE       (0x0u<<2)
#define OTP_SW_LOCK19_NSEC_READ_ONLY        (0x1u<<2)
#define OTP_SW_LOCK19_NSEC_INACCESSIBLE     (0x3u<<2)

// SW_LOCK20 Configuration

#define OTP_SW_LOCK20_SEC                   (0x3u<<0)
#define OTP_SW_LOCK20_SEC_0                 (0x1u<<0)
#define OTP_SW_LOCK20_NSEC                  (0x3u<<2)
#define OTP_SW_LOCK20_NSEC_0                (0x1u<<2)
#define OTP_SW_LOCK20_SEC_READ_WRITE        (0x0u<<0)
#define OTP_SW_LOCK20_SEC_READ_ONLY         (0x1u<<0)
#define OTP_SW_LOCK20_SEC_INACCESSIBLE      (0x3u<<0)
#define OTP_SW_LOCK20_NSEC_READ_WRITE       (0x0u<<2)
#define OTP_SW_LOCK20_NSEC_READ_ONLY        (0x1u<<2)
#define OTP_SW_LOCK20_NSEC_INACCESSIBLE     (0x3u<<2)

// SW_LOCK21 Configuration

#define OTP_SW_LOCK21_SEC                   (0x3u<<0)
#define OTP_SW_LOCK21_SEC_0                 (0x1u<<0)
#define OTP_SW_LOCK21_NSEC                  (0x3u<<2)
#define OTP_SW_LOCK21_NSEC_0                (0x1u<<2)
#define OTP_SW_LOCK21_SEC_READ_WRITE        (0x0u<<0)
#define OTP_SW_LOCK21_SEC_READ_ONLY         (0x1u<<0)
#define OTP_SW_LOCK21_SEC_INACCESSIBLE      (0x3u<<0)
#define OTP_SW_LOCK21_NSEC_READ_WRITE       (0x0u<<2)
#define OTP_SW_LOCK21_NSEC_READ_ONLY        (0x1u<<2)
#define OTP_SW_LOCK21_NSEC_INACCESSIBLE     (0x3u<<2)

// SW_LOCK22 Configuration

#define OTP_SW_LOCK22_SEC                   (0x3u<<0)
#define OTP_SW_LOCK22_SEC_0                 (0x1u<<0)
#define OTP_SW_LOCK22_NSEC                  (0x3u<<2)
#define OTP_SW_LOCK22_NSEC_0                (0x1u<<2)
#define OTP_SW_LOCK22_SEC_READ_WRITE        (0x0u<<0)
#define OTP_SW_LOCK22_SEC_READ_ONLY         (0x1u<<0)
#define OTP_SW_LOCK22_SEC_INACCESSIBLE      (0x3u<<0)
#define OTP_SW_LOCK22_NSEC_READ_WRITE       (0x0u<<2)
#define OTP_SW_LOCK22_NSEC_READ_ONLY        (0x1u<<2)
#define OTP_SW_LOCK22_NSEC_INACCESSIBLE     (0x3u<<2)

// SW_LOCK23 Configuration

#define OTP_SW_LOCK23_SEC                   (0x3u<<0)
#define OTP_SW_LOCK23_SEC_0                 (0x1u<<0)
#define OTP_SW_LOCK23_NSEC                  (0x3u<<2)
#define OTP_SW_LOCK23_NSEC_0                (0x1u<<2)
#define OTP_SW_LOCK23_SEC_READ_WRITE        (0x0u<<0)
#define OTP_SW_LOCK23_SEC_READ_ONLY         (0x1u<<0)
#define OTP_SW_LOCK23_SEC_INACCESSIBLE      (0x3u<<0)
#define OTP_SW_LOCK23_NSEC_READ_WRITE       (0x0u<<2)
#define OTP_SW_LOCK23_NSEC_READ_ONLY        (0x1u<<2)
#define OTP_SW_LOCK23_NSEC_INACCESSIBLE     (0x3u<<2)

// SW_LOCK24 Configuration

#define OTP_SW_LOCK24_SEC                   (0x3u<<0)
#define OTP_SW_LOCK24_SEC_0                 (0x1u<<0)
#define OTP_SW_LOCK24_NSEC                  (0x3u<<2)
#define OTP_SW_LOCK24_NSEC_0                (0x1u<<2)
#define OTP_SW_LOCK24_SEC_READ_WRITE        (0x0u<<0)
#define OTP_SW_LOCK24_SEC_READ_ONLY         (0x1u<<0)
#define OTP_SW_LOCK24_SEC_INACCESSIBLE      (0x3u<<0)
#define OTP_SW_LOCK24_NSEC_READ_WRITE       (0x0u<<2)
#define OTP_SW_LOCK24_NSEC_READ_ONLY        (0x1u<<2)
#define OTP_SW_LOCK24_NSEC_INACCESSIBLE     (0x3u<<2)

// SW_LOCK25 Configuration

