Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/rp2350/Includes/Registers/RP2350_otp.h
#define OTP_SW_LOCK25_SEC                   (0x3u<<0)
#define OTP_SW_LOCK25_SEC_0                 (0x1u<<0)
#define OTP_SW_LOCK25_NSEC                  (0x3u<<2)
#define OTP_SW_LOCK25_NSEC_0                (0x1u<<2)
#define OTP_SW_LOCK25_SEC_READ_WRITE        (0x0u<<0)
#define OTP_SW_LOCK25_SEC_READ_ONLY         (0x1u<<0)
#define OTP_SW_LOCK25_SEC_INACCESSIBLE      (0x3u<<0)
#define OTP_SW_LOCK25_NSEC_READ_WRITE       (0x0u<<2)
#define OTP_SW_LOCK25_NSEC_READ_ONLY        (0x1u<<2)
#define OTP_SW_LOCK25_NSEC_INACCESSIBLE     (0x3u<<2)

// SW_LOCK26 Configuration

#define OTP_SW_LOCK26_SEC                   (0x3u<<0)
#define OTP_SW_LOCK26_SEC_0                 (0x1u<<0)
#define OTP_SW_LOCK26_NSEC                  (0x3u<<2)
#define OTP_SW_LOCK26_NSEC_0                (0x1u<<2)
#define OTP_SW_LOCK26_SEC_READ_WRITE        (0x0u<<0)
#define OTP_SW_LOCK26_SEC_READ_ONLY         (0x1u<<0)
#define OTP_SW_LOCK26_SEC_INACCESSIBLE      (0x3u<<0)
#define OTP_SW_LOCK26_NSEC_READ_WRITE       (0x0u<<2)
#define OTP_SW_LOCK26_NSEC_READ_ONLY        (0x1u<<2)
#define OTP_SW_LOCK26_NSEC_INACCESSIBLE     (0x3u<<2)

// SW_LOCK27 Configuration

#define OTP_SW_LOCK27_SEC                   (0x3u<<0)
#define OTP_SW_LOCK27_SEC_0                 (0x1u<<0)
#define OTP_SW_LOCK27_NSEC                  (0x3u<<2)
#define OTP_SW_LOCK27_NSEC_0                (0x1u<<2)
#define OTP_SW_LOCK27_SEC_READ_WRITE        (0x0u<<0)
#define OTP_SW_LOCK27_SEC_READ_ONLY         (0x1u<<0)
#define OTP_SW_LOCK27_SEC_INACCESSIBLE      (0x3u<<0)
#define OTP_SW_LOCK27_NSEC_READ_WRITE       (0x0u<<2)
#define OTP_SW_LOCK27_NSEC_READ_ONLY        (0x1u<<2)
#define OTP_SW_LOCK27_NSEC_INACCESSIBLE     (0x3u<<2)

// SW_LOCK28 Configuration

#define OTP_SW_LOCK28_SEC                   (0x3u<<0)
#define OTP_SW_LOCK28_SEC_0                 (0x1u<<0)
#define OTP_SW_LOCK28_NSEC                  (0x3u<<2)
#define OTP_SW_LOCK28_NSEC_0                (0x1u<<2)
#define OTP_SW_LOCK28_SEC_READ_WRITE        (0x0u<<0)
#define OTP_SW_LOCK28_SEC_READ_ONLY         (0x1u<<0)
#define OTP_SW_LOCK28_SEC_INACCESSIBLE      (0x3u<<0)
#define OTP_SW_LOCK28_NSEC_READ_WRITE       (0x0u<<2)
#define OTP_SW_LOCK28_NSEC_READ_ONLY        (0x1u<<2)
#define OTP_SW_LOCK28_NSEC_INACCESSIBLE     (0x3u<<2)

// SW_LOCK29 Configuration

#define OTP_SW_LOCK29_SEC                   (0x3u<<0)
#define OTP_SW_LOCK29_SEC_0                 (0x1u<<0)
#define OTP_SW_LOCK29_NSEC                  (0x3u<<2)
#define OTP_SW_LOCK29_NSEC_0                (0x1u<<2)
#define OTP_SW_LOCK29_SEC_READ_WRITE        (0x0u<<0)
#define OTP_SW_LOCK29_SEC_READ_ONLY         (0x1u<<0)
#define OTP_SW_LOCK29_SEC_INACCESSIBLE      (0x3u<<0)
#define OTP_SW_LOCK29_NSEC_READ_WRITE       (0x0u<<2)
#define OTP_SW_LOCK29_NSEC_READ_ONLY        (0x1u<<2)
#define OTP_SW_LOCK29_NSEC_INACCESSIBLE     (0x3u<<2)

// SW_LOCK30 Configuration

#define OTP_SW_LOCK30_SEC                   (0x3u<<0)
#define OTP_SW_LOCK30_SEC_0                 (0x1u<<0)
#define OTP_SW_LOCK30_NSEC                  (0x3u<<2)
#define OTP_SW_LOCK30_NSEC_0                (0x1u<<2)
#define OTP_SW_LOCK30_SEC_READ_WRITE        (0x0u<<0)
#define OTP_SW_LOCK30_SEC_READ_ONLY         (0x1u<<0)
#define OTP_SW_LOCK30_SEC_INACCESSIBLE      (0x3u<<0)
#define OTP_SW_LOCK30_NSEC_READ_WRITE       (0x0u<<2)
#define OTP_SW_LOCK30_NSEC_READ_ONLY        (0x1u<<2)
#define OTP_SW_LOCK30_NSEC_INACCESSIBLE     (0x3u<<2)

// SW_LOCK31 Configuration

#define OTP_SW_LOCK31_SEC                   (0x3u<<0)
#define OTP_SW_LOCK31_SEC_0                 (0x1u<<0)
#define OTP_SW_LOCK31_NSEC                  (0x3u<<2)
#define OTP_SW_LOCK31_NSEC_0                (0x1u<<2)
#define OTP_SW_LOCK31_SEC_READ_WRITE        (0x0u<<0)
#define OTP_SW_LOCK31_SEC_READ_ONLY         (0x1u<<0)
#define OTP_SW_LOCK31_SEC_INACCESSIBLE      (0x3u<<0)
#define OTP_SW_LOCK31_NSEC_READ_WRITE       (0x0u<<2)
#define OTP_SW_LOCK31_NSEC_READ_ONLY        (0x1u<<2)
#define OTP_SW_LOCK31_NSEC_INACCESSIBLE     (0x3u<<2)

// SW_LOCK32 Configuration

#define OTP_SW_LOCK32_SEC                   (0x3u<<0)
#define OTP_SW_LOCK32_SEC_0                 (0x1u<<0)
#define OTP_SW_LOCK32_NSEC                  (0x3u<<2)
#define OTP_SW_LOCK32_NSEC_0                (0x1u<<2)
#define OTP_SW_LOCK32_SEC_READ_WRITE        (0x0u<<0)
#define OTP_SW_LOCK32_SEC_READ_ONLY         (0x1u<<0)
#define OTP_SW_LOCK32_SEC_INACCESSIBLE      (0x3u<<0)
#define OTP_SW_LOCK32_NSEC_READ_WRITE       (0x0u<<2)
#define OTP_SW_LOCK32_NSEC_READ_ONLY        (0x1u<<2)
#define OTP_SW_LOCK32_NSEC_INACCESSIBLE     (0x3u<<2)

// SW_LOCK33 Configuration

#define OTP_SW_LOCK33_SEC                   (0x3u<<0)
#define OTP_SW_LOCK33_SEC_0                 (0x1u<<0)
#define OTP_SW_LOCK33_NSEC                  (0x3u<<2)
#define OTP_SW_LOCK33_NSEC_0                (0x1u<<2)
#define OTP_SW_LOCK33_SEC_READ_WRITE        (0x0u<<0)
#define OTP_SW_LOCK33_SEC_READ_ONLY         (0x1u<<0)
#define OTP_SW_LOCK33_SEC_INACCESSIBLE      (0x3u<<0)
#define OTP_SW_LOCK33_NSEC_READ_WRITE       (0x0u<<2)
#define OTP_SW_LOCK33_NSEC_READ_ONLY        (0x1u<<2)
#define OTP_SW_LOCK33_NSEC_INACCESSIBLE     (0x3u<<2)

// SW_LOCK34 Configuration

#define OTP_SW_LOCK34_SEC                   (0x3u<<0)
#define OTP_SW_LOCK34_SEC_0                 (0x1u<<0)
#define OTP_SW_LOCK34_NSEC                  (0x3u<<2)
#define OTP_SW_LOCK34_NSEC_0                (0x1u<<2)
#define OTP_SW_LOCK34_SEC_READ_WRITE        (0x0u<<0)
#define OTP_SW_LOCK34_SEC_READ_ONLY         (0x1u<<0)
#define OTP_SW_LOCK34_SEC_INACCESSIBLE      (0x3u<<0)
#define OTP_SW_LOCK34_NSEC_READ_WRITE       (0x0u<<2)
#define OTP_SW_LOCK34_NSEC_READ_ONLY        (0x1u<<2)
#define OTP_SW_LOCK34_NSEC_INACCESSIBLE     (0x3u<<2)

// SW_LOCK35 Configuration

#define OTP_SW_LOCK35_SEC                   (0x3u<<0)
#define OTP_SW_LOCK35_SEC_0                 (0x1u<<0)
#define OTP_SW_LOCK35_NSEC                  (0x3u<<2)
#define OTP_SW_LOCK35_NSEC_0                (0x1u<<2)
#define OTP_SW_LOCK35_SEC_READ_WRITE        (0x0u<<0)
#define OTP_SW_LOCK35_SEC_READ_ONLY         (0x1u<<0)
#define OTP_SW_LOCK35_SEC_INACCESSIBLE      (0x3u<<0)
#define OTP_SW_LOCK35_NSEC_READ_WRITE       (0x0u<<2)
#define OTP_SW_LOCK35_NSEC_READ_ONLY        (0x1u<<2)
#define OTP_SW_LOCK35_NSEC_INACCESSIBLE     (0x3u<<2)

// SW_LOCK36 Configuration

#define OTP_SW_LOCK36_SEC                   (0x3u<<0)
#define OTP_SW_LOCK36_SEC_0                 (0x1u<<0)
#define OTP_SW_LOCK36_NSEC                  (0x3u<<2)
#define OTP_SW_LOCK36_NSEC_0                (0x1u<<2)
#define OTP_SW_LOCK36_SEC_READ_WRITE        (0x0u<<0)
#define OTP_SW_LOCK36_SEC_READ_ONLY         (0x1u<<0)
#define OTP_SW_LOCK36_SEC_INACCESSIBLE      (0x3u<<0)
#define OTP_SW_LOCK36_NSEC_READ_WRITE       (0x0u<<2)
#define OTP_SW_LOCK36_NSEC_READ_ONLY        (0x1u<<2)
#define OTP_SW_LOCK36_NSEC_INACCESSIBLE     (0x3u<<2)

// SW_LOCK37 Configuration

