Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/rp2350/Includes/Registers/RP2350_otp.h
#define OTP_SW_LOCK37_SEC                   (0x3u<<0)
#define OTP_SW_LOCK37_SEC_0                 (0x1u<<0)
#define OTP_SW_LOCK37_NSEC                  (0x3u<<2)
#define OTP_SW_LOCK37_NSEC_0                (0x1u<<2)
#define OTP_SW_LOCK37_SEC_READ_WRITE        (0x0u<<0)
#define OTP_SW_LOCK37_SEC_READ_ONLY         (0x1u<<0)
#define OTP_SW_LOCK37_SEC_INACCESSIBLE      (0x3u<<0)
#define OTP_SW_LOCK37_NSEC_READ_WRITE       (0x0u<<2)
#define OTP_SW_LOCK37_NSEC_READ_ONLY        (0x1u<<2)
#define OTP_SW_LOCK37_NSEC_INACCESSIBLE     (0x3u<<2)

// SW_LOCK38 Configuration

#define OTP_SW_LOCK38_SEC                   (0x3u<<0)
#define OTP_SW_LOCK38_SEC_0                 (0x1u<<0)
#define OTP_SW_LOCK38_NSEC                  (0x3u<<2)
#define OTP_SW_LOCK38_NSEC_0                (0x1u<<2)
#define OTP_SW_LOCK38_SEC_READ_WRITE        (0x0u<<0)
#define OTP_SW_LOCK38_SEC_READ_ONLY         (0x1u<<0)
#define OTP_SW_LOCK38_SEC_INACCESSIBLE      (0x3u<<0)
#define OTP_SW_LOCK38_NSEC_READ_WRITE       (0x0u<<2)
#define OTP_SW_LOCK38_NSEC_READ_ONLY        (0x1u<<2)
#define OTP_SW_LOCK38_NSEC_INACCESSIBLE     (0x3u<<2)

// SW_LOCK39 Configuration

#define OTP_SW_LOCK39_SEC                   (0x3u<<0)
#define OTP_SW_LOCK39_SEC_0                 (0x1u<<0)
#define OTP_SW_LOCK39_NSEC                  (0x3u<<2)
#define OTP_SW_LOCK39_NSEC_0                (0x1u<<2)
#define OTP_SW_LOCK39_SEC_READ_WRITE        (0x0u<<0)
#define OTP_SW_LOCK39_SEC_READ_ONLY         (0x1u<<0)
#define OTP_SW_LOCK39_SEC_INACCESSIBLE      (0x3u<<0)
#define OTP_SW_LOCK39_NSEC_READ_WRITE       (0x0u<<2)
#define OTP_SW_LOCK39_NSEC_READ_ONLY        (0x1u<<2)
#define OTP_SW_LOCK39_NSEC_INACCESSIBLE     (0x3u<<2)

// SW_LOCK40 Configuration

#define OTP_SW_LOCK40_SEC                   (0x3u<<0)
#define OTP_SW_LOCK40_SEC_0                 (0x1u<<0)
#define OTP_SW_LOCK40_NSEC                  (0x3u<<2)
#define OTP_SW_LOCK40_NSEC_0                (0x1u<<2)
#define OTP_SW_LOCK40_SEC_READ_WRITE        (0x0u<<0)
#define OTP_SW_LOCK40_SEC_READ_ONLY         (0x1u<<0)
#define OTP_SW_LOCK40_SEC_INACCESSIBLE      (0x3u<<0)
#define OTP_SW_LOCK40_NSEC_READ_WRITE       (0x0u<<2)
#define OTP_SW_LOCK40_NSEC_READ_ONLY        (0x1u<<2)
#define OTP_SW_LOCK40_NSEC_INACCESSIBLE     (0x3u<<2)

// SW_LOCK41 Configuration

#define OTP_SW_LOCK41_SEC                   (0x3u<<0)
#define OTP_SW_LOCK41_SEC_0                 (0x1u<<0)
#define OTP_SW_LOCK41_NSEC                  (0x3u<<2)
#define OTP_SW_LOCK41_NSEC_0                (0x1u<<2)
#define OTP_SW_LOCK41_SEC_READ_WRITE        (0x0u<<0)
#define OTP_SW_LOCK41_SEC_READ_ONLY         (0x1u<<0)
#define OTP_SW_LOCK41_SEC_INACCESSIBLE      (0x3u<<0)
#define OTP_SW_LOCK41_NSEC_READ_WRITE       (0x0u<<2)
#define OTP_SW_LOCK41_NSEC_READ_ONLY        (0x1u<<2)
#define OTP_SW_LOCK41_NSEC_INACCESSIBLE     (0x3u<<2)

// SW_LOCK42 Configuration

#define OTP_SW_LOCK42_SEC                   (0x3u<<0)
#define OTP_SW_LOCK42_SEC_0                 (0x1u<<0)
#define OTP_SW_LOCK42_NSEC                  (0x3u<<2)
#define OTP_SW_LOCK42_NSEC_0                (0x1u<<2)
#define OTP_SW_LOCK42_SEC_READ_WRITE        (0x0u<<0)
#define OTP_SW_LOCK42_SEC_READ_ONLY         (0x1u<<0)
#define OTP_SW_LOCK42_SEC_INACCESSIBLE      (0x3u<<0)
#define OTP_SW_LOCK42_NSEC_READ_WRITE       (0x0u<<2)
#define OTP_SW_LOCK42_NSEC_READ_ONLY        (0x1u<<2)
#define OTP_SW_LOCK42_NSEC_INACCESSIBLE     (0x3u<<2)

// SW_LOCK43 Configuration

#define OTP_SW_LOCK43_SEC                   (0x3u<<0)
#define OTP_SW_LOCK43_SEC_0                 (0x1u<<0)
#define OTP_SW_LOCK43_NSEC                  (0x3u<<2)
#define OTP_SW_LOCK43_NSEC_0                (0x1u<<2)
#define OTP_SW_LOCK43_SEC_READ_WRITE        (0x0u<<0)
#define OTP_SW_LOCK43_SEC_READ_ONLY         (0x1u<<0)
#define OTP_SW_LOCK43_SEC_INACCESSIBLE      (0x3u<<0)
#define OTP_SW_LOCK43_NSEC_READ_WRITE       (0x0u<<2)
#define OTP_SW_LOCK43_NSEC_READ_ONLY        (0x1u<<2)
#define OTP_SW_LOCK43_NSEC_INACCESSIBLE     (0x3u<<2)

// SW_LOCK44 Configuration

#define OTP_SW_LOCK44_SEC                   (0x3u<<0)
#define OTP_SW_LOCK44_SEC_0                 (0x1u<<0)
#define OTP_SW_LOCK44_NSEC                  (0x3u<<2)
#define OTP_SW_LOCK44_NSEC_0                (0x1u<<2)
#define OTP_SW_LOCK44_SEC_READ_WRITE        (0x0u<<0)
#define OTP_SW_LOCK44_SEC_READ_ONLY         (0x1u<<0)
#define OTP_SW_LOCK44_SEC_INACCESSIBLE      (0x3u<<0)
#define OTP_SW_LOCK44_NSEC_READ_WRITE       (0x0u<<2)
#define OTP_SW_LOCK44_NSEC_READ_ONLY        (0x1u<<2)
#define OTP_SW_LOCK44_NSEC_INACCESSIBLE     (0x3u<<2)

// SW_LOCK45 Configuration

#define OTP_SW_LOCK45_SEC                   (0x3u<<0)
#define OTP_SW_LOCK45_SEC_0                 (0x1u<<0)
#define OTP_SW_LOCK45_NSEC                  (0x3u<<2)
#define OTP_SW_LOCK45_NSEC_0                (0x1u<<2)
#define OTP_SW_LOCK45_SEC_READ_WRITE        (0x0u<<0)
#define OTP_SW_LOCK45_SEC_READ_ONLY         (0x1u<<0)
#define OTP_SW_LOCK45_SEC_INACCESSIBLE      (0x3u<<0)
#define OTP_SW_LOCK45_NSEC_READ_WRITE       (0x0u<<2)
#define OTP_SW_LOCK45_NSEC_READ_ONLY        (0x1u<<2)
#define OTP_SW_LOCK45_NSEC_INACCESSIBLE     (0x3u<<2)

// SW_LOCK46 Configuration

#define OTP_SW_LOCK46_SEC                   (0x3u<<0)
#define OTP_SW_LOCK46_SEC_0                 (0x1u<<0)
#define OTP_SW_LOCK46_NSEC                  (0x3u<<2)
#define OTP_SW_LOCK46_NSEC_0                (0x1u<<2)
#define OTP_SW_LOCK46_SEC_READ_WRITE        (0x0u<<0)
#define OTP_SW_LOCK46_SEC_READ_ONLY         (0x1u<<0)
#define OTP_SW_LOCK46_SEC_INACCESSIBLE      (0x3u<<0)
#define OTP_SW_LOCK46_NSEC_READ_WRITE       (0x0u<<2)
#define OTP_SW_LOCK46_NSEC_READ_ONLY        (0x1u<<2)
#define OTP_SW_LOCK46_NSEC_INACCESSIBLE     (0x3u<<2)

// SW_LOCK47 Configuration

#define OTP_SW_LOCK47_SEC                   (0x3u<<0)
#define OTP_SW_LOCK47_SEC_0                 (0x1u<<0)
#define OTP_SW_LOCK47_NSEC                  (0x3u<<2)
#define OTP_SW_LOCK47_NSEC_0                (0x1u<<2)
#define OTP_SW_LOCK47_SEC_READ_WRITE        (0x0u<<0)
#define OTP_SW_LOCK47_SEC_READ_ONLY         (0x1u<<0)
#define OTP_SW_LOCK47_SEC_INACCESSIBLE      (0x3u<<0)
#define OTP_SW_LOCK47_NSEC_READ_WRITE       (0x0u<<2)
#define OTP_SW_LOCK47_NSEC_READ_ONLY        (0x1u<<2)
#define OTP_SW_LOCK47_NSEC_INACCESSIBLE     (0x3u<<2)

// SW_LOCK48 Configuration

#define OTP_SW_LOCK48_SEC                   (0x3u<<0)
#define OTP_SW_LOCK48_SEC_0                 (0x1u<<0)
#define OTP_SW_LOCK48_NSEC                  (0x3u<<2)
#define OTP_SW_LOCK48_NSEC_0                (0x1u<<2)
#define OTP_SW_LOCK48_SEC_READ_WRITE        (0x0u<<0)
#define OTP_SW_LOCK48_SEC_READ_ONLY         (0x1u<<0)
#define OTP_SW_LOCK48_SEC_INACCESSIBLE      (0x3u<<0)
#define OTP_SW_LOCK48_NSEC_READ_WRITE       (0x0u<<2)
#define OTP_SW_LOCK48_NSEC_READ_ONLY        (0x1u<<2)
#define OTP_SW_LOCK48_NSEC_INACCESSIBLE     (0x3u<<2)

// SW_LOCK49 Configuration

#define OTP_SW_LOCK49_SEC                   (0x3u<<0)
#define OTP_SW_LOCK49_SEC_0                 (0x1u<<0)
#define OTP_SW_LOCK49_NSEC                  (0x3u<<2)
#define OTP_SW_LOCK49_NSEC_0                (0x1u<<2)
#define OTP_SW_LOCK49_SEC_READ_WRITE        (0x0u<<0)
#define OTP_SW_LOCK49_SEC_READ_ONLY         (0x1u<<0)
#define OTP_SW_LOCK49_SEC_INACCESSIBLE      (0x3u<<0)
#define OTP_SW_LOCK49_NSEC_READ_WRITE       (0x0u<<2)
#define OTP_SW_LOCK49_NSEC_READ_ONLY        (0x1u<<2)
#define OTP_SW_LOCK49_NSEC_INACCESSIBLE     (0x3u<<2)

// SW_LOCK50 Configuration

#define OTP_SW_LOCK50_SEC                   (0x3u<<0)
#define OTP_SW_LOCK50_SEC_0                 (0x1u<<0)
#define OTP_SW_LOCK50_NSEC                  (0x3u<<2)
#define OTP_SW_LOCK50_NSEC_0                (0x1u<<2)
#define OTP_SW_LOCK50_SEC_READ_WRITE        (0x0u<<0)
#define OTP_SW_LOCK50_SEC_READ_ONLY         (0x1u<<0)
#define OTP_SW_LOCK50_SEC_INACCESSIBLE      (0x3u<<0)
#define OTP_SW_LOCK50_NSEC_READ_WRITE       (0x0u<<2)
#define OTP_SW_LOCK50_NSEC_READ_ONLY        (0x1u<<2)
#define OTP_SW_LOCK50_NSEC_INACCESSIBLE     (0x3u<<2)

// SW_LOCK51 Configuration

#define OTP_SW_LOCK51_SEC                   (0x3u<<0)
#define OTP_SW_LOCK51_SEC_0                 (0x1u<<0)
#define OTP_SW_LOCK51_NSEC                  (0x3u<<2)
#define OTP_SW_LOCK51_NSEC_0                (0x1u<<2)
#define OTP_SW_LOCK51_SEC_READ_WRITE        (0x0u<<0)
#define OTP_SW_LOCK51_SEC_READ_ONLY         (0x1u<<0)
#define OTP_SW_LOCK51_SEC_INACCESSIBLE      (0x3u<<0)
#define OTP_SW_LOCK51_NSEC_READ_WRITE       (0x0u<<2)
#define OTP_SW_LOCK51_NSEC_READ_ONLY        (0x1u<<2)
#define OTP_SW_LOCK51_NSEC_INACCESSIBLE     (0x3u<<2)

// SW_LOCK52 Configuration

#define OTP_SW_LOCK52_SEC                   (0x3u<<0)
#define OTP_SW_LOCK52_SEC_0                 (0x1u<<0)
#define OTP_SW_LOCK52_NSEC                  (0x3u<<2)
#define OTP_SW_LOCK52_NSEC_0                (0x1u<<2)
#define OTP_SW_LOCK52_SEC_READ_WRITE        (0x0u<<0)
#define OTP_SW_LOCK52_SEC_READ_ONLY         (0x1u<<0)
#define OTP_SW_LOCK52_SEC_INACCESSIBLE      (0x3u<<0)
#define OTP_SW_LOCK52_NSEC_READ_WRITE       (0x0u<<2)
#define OTP_SW_LOCK52_NSEC_READ_ONLY        (0x1u<<2)
#define OTP_SW_LOCK52_NSEC_INACCESSIBLE     (0x3u<<2)

// SW_LOCK53 Configuration

