Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/rp2350/Includes/Registers/RP2350_otp.h
#define OTP_SW_LOCK53_SEC                   (0x3u<<0)
#define OTP_SW_LOCK53_SEC_0                 (0x1u<<0)
#define OTP_SW_LOCK53_NSEC                  (0x3u<<2)
#define OTP_SW_LOCK53_NSEC_0                (0x1u<<2)
#define OTP_SW_LOCK53_SEC_READ_WRITE        (0x0u<<0)
#define OTP_SW_LOCK53_SEC_READ_ONLY         (0x1u<<0)
#define OTP_SW_LOCK53_SEC_INACCESSIBLE      (0x3u<<0)
#define OTP_SW_LOCK53_NSEC_READ_WRITE       (0x0u<<2)
#define OTP_SW_LOCK53_NSEC_READ_ONLY        (0x1u<<2)
#define OTP_SW_LOCK53_NSEC_INACCESSIBLE     (0x3u<<2)

// SW_LOCK54 Configuration

#define OTP_SW_LOCK54_SEC                   (0x3u<<0)
#define OTP_SW_LOCK54_SEC_0                 (0x1u<<0)
#define OTP_SW_LOCK54_NSEC                  (0x3u<<2)
#define OTP_SW_LOCK54_NSEC_0                (0x1u<<2)
#define OTP_SW_LOCK54_SEC_READ_WRITE        (0x0u<<0)
#define OTP_SW_LOCK54_SEC_READ_ONLY         (0x1u<<0)
#define OTP_SW_LOCK54_SEC_INACCESSIBLE      (0x3u<<0)
#define OTP_SW_LOCK54_NSEC_READ_WRITE       (0x0u<<2)
#define OTP_SW_LOCK54_NSEC_READ_ONLY        (0x1u<<2)
#define OTP_SW_LOCK54_NSEC_INACCESSIBLE     (0x3u<<2)

// SW_LOCK55 Configuration

#define OTP_SW_LOCK55_SEC                   (0x3u<<0)
#define OTP_SW_LOCK55_SEC_0                 (0x1u<<0)
#define OTP_SW_LOCK55_NSEC                  (0x3u<<2)
#define OTP_SW_LOCK55_NSEC_0                (0x1u<<2)
#define OTP_SW_LOCK55_SEC_READ_WRITE        (0x0u<<0)
#define OTP_SW_LOCK55_SEC_READ_ONLY         (0x1u<<0)
#define OTP_SW_LOCK55_SEC_INACCESSIBLE      (0x3u<<0)
#define OTP_SW_LOCK55_NSEC_READ_WRITE       (0x0u<<2)
#define OTP_SW_LOCK55_NSEC_READ_ONLY        (0x1u<<2)
#define OTP_SW_LOCK55_NSEC_INACCESSIBLE     (0x3u<<2)

// SW_LOCK56 Configuration

#define OTP_SW_LOCK56_SEC                   (0x3u<<0)
#define OTP_SW_LOCK56_SEC_0                 (0x1u<<0)
#define OTP_SW_LOCK56_NSEC                  (0x3u<<2)
#define OTP_SW_LOCK56_NSEC_0                (0x1u<<2)
#define OTP_SW_LOCK56_SEC_READ_WRITE        (0x0u<<0)
#define OTP_SW_LOCK56_SEC_READ_ONLY         (0x1u<<0)
#define OTP_SW_LOCK56_SEC_INACCESSIBLE      (0x3u<<0)
#define OTP_SW_LOCK56_NSEC_READ_WRITE       (0x0u<<2)
#define OTP_SW_LOCK56_NSEC_READ_ONLY        (0x1u<<2)
#define OTP_SW_LOCK56_NSEC_INACCESSIBLE     (0x3u<<2)

// SW_LOCK57 Configuration

#define OTP_SW_LOCK57_SEC                   (0x3u<<0)
#define OTP_SW_LOCK57_SEC_0                 (0x1u<<0)
#define OTP_SW_LOCK57_NSEC                  (0x3u<<2)
#define OTP_SW_LOCK57_NSEC_0                (0x1u<<2)
#define OTP_SW_LOCK57_SEC_READ_WRITE        (0x0u<<0)
#define OTP_SW_LOCK57_SEC_READ_ONLY         (0x1u<<0)
#define OTP_SW_LOCK57_SEC_INACCESSIBLE      (0x3u<<0)
#define OTP_SW_LOCK57_NSEC_READ_WRITE       (0x0u<<2)
#define OTP_SW_LOCK57_NSEC_READ_ONLY        (0x1u<<2)
#define OTP_SW_LOCK57_NSEC_INACCESSIBLE     (0x3u<<2)

// SW_LOCK58 Configuration

#define OTP_SW_LOCK58_SEC                   (0x3u<<0)
#define OTP_SW_LOCK58_SEC_0                 (0x1u<<0)
#define OTP_SW_LOCK58_NSEC                  (0x3u<<2)
#define OTP_SW_LOCK58_NSEC_0                (0x1u<<2)
#define OTP_SW_LOCK58_SEC_READ_WRITE        (0x0u<<0)
#define OTP_SW_LOCK58_SEC_READ_ONLY         (0x1u<<0)
#define OTP_SW_LOCK58_SEC_INACCESSIBLE      (0x3u<<0)
#define OTP_SW_LOCK58_NSEC_READ_WRITE       (0x0u<<2)
#define OTP_SW_LOCK58_NSEC_READ_ONLY        (0x1u<<2)
#define OTP_SW_LOCK58_NSEC_INACCESSIBLE     (0x3u<<2)

// SW_LOCK59 Configuration

#define OTP_SW_LOCK59_SEC                   (0x3u<<0)
#define OTP_SW_LOCK59_SEC_0                 (0x1u<<0)
#define OTP_SW_LOCK59_NSEC                  (0x3u<<2)
#define OTP_SW_LOCK59_NSEC_0                (0x1u<<2)
#define OTP_SW_LOCK59_SEC_READ_WRITE        (0x0u<<0)
#define OTP_SW_LOCK59_SEC_READ_ONLY         (0x1u<<0)
#define OTP_SW_LOCK59_SEC_INACCESSIBLE      (0x3u<<0)
#define OTP_SW_LOCK59_NSEC_READ_WRITE       (0x0u<<2)
#define OTP_SW_LOCK59_NSEC_READ_ONLY        (0x1u<<2)
#define OTP_SW_LOCK59_NSEC_INACCESSIBLE     (0x3u<<2)

// SW_LOCK60 Configuration

#define OTP_SW_LOCK60_SEC                   (0x3u<<0)
#define OTP_SW_LOCK60_SEC_0                 (0x1u<<0)
#define OTP_SW_LOCK60_NSEC                  (0x3u<<2)
#define OTP_SW_LOCK60_NSEC_0                (0x1u<<2)
#define OTP_SW_LOCK60_SEC_READ_WRITE        (0x0u<<0)
#define OTP_SW_LOCK60_SEC_READ_ONLY         (0x1u<<0)
#define OTP_SW_LOCK60_SEC_INACCESSIBLE      (0x3u<<0)
#define OTP_SW_LOCK60_NSEC_READ_WRITE       (0x0u<<2)
#define OTP_SW_LOCK60_NSEC_READ_ONLY        (0x1u<<2)
#define OTP_SW_LOCK60_NSEC_INACCESSIBLE     (0x3u<<2)

// SW_LOCK61 Configuration

#define OTP_SW_LOCK61_SEC                   (0x3u<<0)
#define OTP_SW_LOCK61_SEC_0                 (0x1u<<0)
#define OTP_SW_LOCK61_NSEC                  (0x3u<<2)
#define OTP_SW_LOCK61_NSEC_0                (0x1u<<2)
#define OTP_SW_LOCK61_SEC_READ_WRITE        (0x0u<<0)
#define OTP_SW_LOCK61_SEC_READ_ONLY         (0x1u<<0)
#define OTP_SW_LOCK61_SEC_INACCESSIBLE      (0x3u<<0)
#define OTP_SW_LOCK61_NSEC_READ_WRITE       (0x0u<<2)
#define OTP_SW_LOCK61_NSEC_READ_ONLY        (0x1u<<2)
#define OTP_SW_LOCK61_NSEC_INACCESSIBLE     (0x3u<<2)

// SW_LOCK62 Configuration

#define OTP_SW_LOCK62_SEC                   (0x3u<<0)
#define OTP_SW_LOCK62_SEC_0                 (0x1u<<0)
#define OTP_SW_LOCK62_NSEC                  (0x3u<<2)
#define OTP_SW_LOCK62_NSEC_0                (0x1u<<2)
#define OTP_SW_LOCK62_SEC_READ_WRITE        (0x0u<<0)
#define OTP_SW_LOCK62_SEC_READ_ONLY         (0x1u<<0)
#define OTP_SW_LOCK62_SEC_INACCESSIBLE      (0x3u<<0)
#define OTP_SW_LOCK62_NSEC_READ_WRITE       (0x0u<<2)
#define OTP_SW_LOCK62_NSEC_READ_ONLY        (0x1u<<2)
#define OTP_SW_LOCK62_NSEC_INACCESSIBLE     (0x3u<<2)

// SW_LOCK63 Configuration

#define OTP_SW_LOCK63_SEC                   (0x3u<<0)
#define OTP_SW_LOCK63_SEC_0                 (0x1u<<0)
#define OTP_SW_LOCK63_NSEC                  (0x3u<<2)
#define OTP_SW_LOCK63_NSEC_0                (0x1u<<2)
#define OTP_SW_LOCK63_SEC_READ_WRITE        (0x0u<<0)
#define OTP_SW_LOCK63_SEC_READ_ONLY         (0x1u<<0)
#define OTP_SW_LOCK63_SEC_INACCESSIBLE      (0x3u<<0)
#define OTP_SW_LOCK63_NSEC_READ_WRITE       (0x0u<<2)
#define OTP_SW_LOCK63_NSEC_READ_ONLY        (0x1u<<2)
#define OTP_SW_LOCK63_NSEC_INACCESSIBLE     (0x3u<<2)

// SBPI_INSTR Configuration

#define OTP_SBPI_INSTR_SHORT_WDATA          (0xFFu<<0)
#define OTP_SBPI_INSTR_SHORT_WDATA_0        (0x1u<<0)
#define OTP_SBPI_INSTR_CMD                  (0xFFu<<8)
#define OTP_SBPI_INSTR_CMD_0                (0x1u<<8)
#define OTP_SBPI_INSTR_TARGET               (0xFFu<<16)
#define OTP_SBPI_INSTR_TARGET_0             (0x1u<<16)
#define OTP_SBPI_INSTR_PAYLOAD_SIZE_M1      (0xFu<<24)
#define OTP_SBPI_INSTR_PAYLOAD_SIZE_M1_0    (0x1u<<24)
#define OTP_SBPI_INSTR_HAS_PAYLOAD          (0x1u<<28)
#define OTP_SBPI_INSTR_IS_WR                (0x1u<<29)
#define OTP_SBPI_INSTR_EXEC                 (0x1u<<30)

