Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/rp2350/Includes/Registers/RP2350_otp.h
// SBPI_WDATA_0 Configuration

#define OTP_SBPI_WDATA_0_SBPI_WDATA_0       (0xFFFFFFFFu<<0)
#define OTP_SBPI_WDATA_0_SBPI_WDATA_0_0     (0x1u<<0)

// SBPI_WDATA_1 Configuration

#define OTP_SBPI_WDATA_1_SBPI_WDATA_1       (0xFFFFFFFFu<<0)
#define OTP_SBPI_WDATA_1_SBPI_WDATA_1_0     (0x1u<<0)

// SBPI_WDATA_2 Configuration

#define OTP_SBPI_WDATA_2_SBPI_WDATA_2       (0xFFFFFFFFu<<0)
#define OTP_SBPI_WDATA_2_SBPI_WDATA_2_0     (0x1u<<0)

// SBPI_WDATA_3 Configuration

#define OTP_SBPI_WDATA_3_SBPI_WDATA_3       (0xFFFFFFFFu<<0)
#define OTP_SBPI_WDATA_3_SBPI_WDATA_3_0     (0x1u<<0)

// SBPI_RDATA_0 Configuration

#define OTP_SBPI_RDATA_0_SBPI_RDATA_0       (0xFFFFFFFFu<<0)
#define OTP_SBPI_RDATA_0_SBPI_RDATA_0_0     (0x1u<<0)

// SBPI_RDATA_1 Configuration

#define OTP_SBPI_RDATA_1_SBPI_RDATA_1       (0xFFFFFFFFu<<0)
#define OTP_SBPI_RDATA_1_SBPI_RDATA_1_0     (0x1u<<0)

// SBPI_RDATA_2 Configuration

#define OTP_SBPI_RDATA_2_SBPI_RDATA_2       (0xFFFFFFFFu<<0)
#define OTP_SBPI_RDATA_2_SBPI_RDATA_2_0     (0x1u<<0)

// SBPI_RDATA_3 Configuration

#define OTP_SBPI_RDATA_3_SBPI_RDATA_3       (0xFFFFFFFFu<<0)
#define OTP_SBPI_RDATA_3_SBPI_RDATA_3_0     (0x1u<<0)

// SBPI_STATUS Configuration

#define OTP_SBPI_STATUS_RDATA_VLD           (0x1u<<0)
#define OTP_SBPI_STATUS_INSTR_DONE          (0x1u<<4)
#define OTP_SBPI_STATUS_INSTR_MISS          (0x1u<<8)
#define OTP_SBPI_STATUS_FLAG                (0x1u<<12)
#define OTP_SBPI_STATUS_MISO                (0xFFu<<16)
#define OTP_SBPI_STATUS_MISO_0              (0x1u<<16)

// USR Configuration

#define OTP_USR_DCTRL                       (0x1u<<0)
#define OTP_USR_PD                          (0x1u<<4)

// DBG Configuration

#define OTP_DBG_PSM_DONE                    (0x1u<<0)
#define OTP_DBG_BOOT_DONE                   (0x1u<<1)
#define OTP_DBG_ROSC_UP_SEEN                (0x1u<<2)
#define OTP_DBG_ROSC_UP                     (0x1u<<3)
#define OTP_DBG_PSM_STATE                   (0xFu<<4)
#define OTP_DBG_PSM_STATE_0                 (0x1u<<4)
#define OTP_DBG_CUSTOMER_RMA_FLAG           (0x1u<<12)

// BIST Configuration

#define OTP_BIST_CNT                        (0x1FFFu<<0)
#define OTP_BIST_CNT_0                      (0x1u<<0)
#define OTP_BIST_CNT_MAX                    (0xFFFu<<16)
#define OTP_BIST_CNT_MAX_0                  (0x1u<<16)
#define OTP_BIST_CNT_ENA                    (0x1u<<28)
#define OTP_BIST_CNT_CLR                    (0x1u<<29)
#define OTP_BIST_CNT_FAIL                   (0x1u<<30)

// CRT_KEY_W0 Configuration

#define OTP_CRT_KEY_W0_CRT_KEY_W0           (0xFFFFFFFFu<<0)
#define OTP_CRT_KEY_W0_CRT_KEY_W0_0         (0x1u<<0)

// CRT_KEY_W1 Configuration

#define OTP_CRT_KEY_W1_CRT_KEY_W1           (0xFFFFFFFFu<<0)
#define OTP_CRT_KEY_W1_CRT_KEY_W1_0         (0x1u<<0)

// CRT_KEY_W2 Configuration

#define OTP_CRT_KEY_W2_CRT_KEY_W2           (0xFFFFFFFFu<<0)
#define OTP_CRT_KEY_W2_CRT_KEY_W2_0         (0x1u<<0)

// CRT_KEY_W3 Configuration

#define OTP_CRT_KEY_W3_CRT_KEY_W3           (0xFFFFFFFFu<<0)
#define OTP_CRT_KEY_W3_CRT_KEY_W3_0         (0x1u<<0)

// CRITICAL Configuration

#define OTP_CRITICAL_SECURE_BOOT_ENABLE     (0x1u<<0)
#define OTP_CRITICAL_SECURE_DEBUG_DISABLE   (0x1u<<1)
#define OTP_CRITICAL_DEBUG_DISABLE          (0x1u<<2)
#define OTP_CRITICAL_DEFAULT_ARCHSEL        (0x1u<<3)
#define OTP_CRITICAL_GLITCH_DETECTOR_ENABLE (0x1u<<4)
#define OTP_CRITICAL_GLITCH_DETECTOR_SENS   (0x3u<<5)
#define OTP_CRITICAL_GLITCH_DETECTOR_SENS_0 (0x1u<<5)
#define OTP_CRITICAL_ARM_DISABLE            (0x1u<<16)
#define OTP_CRITICAL_RISCV_DISABLE          (0x1u<<17)

// KEY_VALID Configuration

#define OTP_KEY_VALID_KEY_VALID             (0xFFu<<0)
#define OTP_KEY_VALID_KEY_VALID_0           (0x1u<<0)

// DEBUGEN Configuration

#define OTP_DEBUGEN_PROC0                   (0x1u<<0)
#define OTP_DEBUGEN_PROC0_SECURE            (0x1u<<1)
#define OTP_DEBUGEN_PROC1                   (0x1u<<2)
#define OTP_DEBUGEN_PROC1_SECURE            (0x1u<<3)
#define OTP_DEBUGEN_MISC                    (0x1u<<8)

// DEBUGEN_LOCK Configuration

#define OTP_DEBUGEN_LOCK_PROC0              (0x1u<<0)
#define OTP_DEBUGEN_LOCK_PROC0_SECURE       (0x1u<<1)
#define OTP_DEBUGEN_LOCK_PROC1              (0x1u<<2)
#define OTP_DEBUGEN_LOCK_PROC1_SECURE       (0x1u<<3)
#define OTP_DEBUGEN_LOCK_MISC               (0x1u<<8)

// ARCHSEL Configuration

#define OTP_ARCHSEL_CORE0                   (0x1u<<0)
#define OTP_ARCHSEL_CORE1                   (0x1u<<1)
#define OTP_ARCHSEL_CORE0_ARM               (0x0u<<0)
#define OTP_ARCHSEL_CORE0_RISCV             (0x1u<<0)
#define OTP_ARCHSEL_CORE1_ARM               (0x0u<<1)
#define OTP_ARCHSEL_CORE1_RISCV             (0x1u<<1)

// ARCHSEL_STATUS Configuration

#define OTP_ARCHSEL_STATUS_CORE0            (0x1u<<0)
#define OTP_ARCHSEL_STATUS_CORE1            (0x1u<<1)
#define OTP_ARCHSEL_STATUS_CORE0_ARM        (0x0u<<0)
#define OTP_ARCHSEL_STATUS_CORE0_RISCV      (0x1u<<0)
#define OTP_ARCHSEL_STATUS_CORE1_ARM        (0x0u<<1)
#define OTP_ARCHSEL_STATUS_CORE1_RISCV      (0x1u<<1)

// BOOTDIS Configuration

#define OTP_BOOTDIS_NOW                     (0x1u<<0)
#define OTP_BOOTDIS_NEXT                    (0x1u<<1)

// INTR Configuration

#define OTP_INTR_SBPI_FLAG_N                (0x1u<<0)
#define OTP_INTR_SBPI_WR_FAIL               (0x1u<<1)
#define OTP_INTR_APB_DCTRL_FAIL             (0x1u<<2)
#define OTP_INTR_APB_RD_SEC_FAIL            (0x1u<<3)
#define OTP_INTR_APB_RD_NSEC_FAIL           (0x1u<<4)

// INTE Configuration

#define OTP_INTE_SBPI_FLAG_N                (0x1u<<0)
#define OTP_INTE_SBPI_WR_FAIL               (0x1u<<1)
#define OTP_INTE_APB_DCTRL_FAIL             (0x1u<<2)
#define OTP_INTE_APB_RD_SEC_FAIL            (0x1u<<3)
#define OTP_INTE_APB_RD_NSEC_FAIL           (0x1u<<4)

// INTF Configuration

#define OTP_INTF_SBPI_FLAG_N                (0x1u<<0)
#define OTP_INTF_SBPI_WR_FAIL               (0x1u<<1)
#define OTP_INTF_APB_DCTRL_FAIL             (0x1u<<2)
#define OTP_INTF_APB_RD_SEC_FAIL            (0x1u<<3)
#define OTP_INTF_APB_RD_NSEC_FAIL           (0x1u<<4)

// INTS Configuration

#define OTP_INTS_SBPI_FLAG_N                (0x1u<<0)
#define OTP_INTS_SBPI_WR_FAIL               (0x1u<<1)
#define OTP_INTS_APB_DCTRL_FAIL             (0x1u<<2)
#define OTP_INTS_APB_RD_SEC_FAIL            (0x1u<<3)
#define OTP_INTS_APB_RD_NSEC_FAIL           (0x1u<<4)
